controllers/SiteController.php

SELECT * FROM `student`
---
    public function actionIndex()
    {
        // $posts = Posts::find()->all();
         // return $this->render('home',['posts' => $posts]);

        $student = Student::find()->all();

SELECT * FROM `course`
SELECT * FROM `subject`
INSERT INTO `student` (`full_name`, `contact`, `address`, `date_of_birth`, `course_books`, `subject`) VALUES ('noman', '03122322222', 'latifabad', '2006-12-14', '1,2,3,4,5,6', 3)
---
    public function actionCreate(){
        $student = new Student();
        $course = Course::find()->all();
        $subject = Subject::find()->all(); // Make sure to adjust the namespace for your Course model

        // Make sure to adjust the namespace for your Course model

        $formData = Yii::$app->request->post();
        if($student->load($formData)){

   // Convert the array of selected subject IDs to a string before saving
        $selectedSubjectIds = Yii::$app->request->post('Student')['subject'];
        $student->subject = implode(',', $selectedSubjectIds);


                // Convert the array of selected course IDs to a string before saving
        $selectedCourseIds = Yii::$app->request->post('Student')['course_books'];
        $student->course_books = implode(',', $selectedCourseIds);

            if($student->save()){